Repository: Barmaley74/Brain-Import-Price
Catalog: woo_bip-*.po
Languages: ru_ru

source: Products
ru_ru: Товары

source: <strong>Brain Import Price</strong> - Import Products into WooCommerce from a price CSV file.
ru_ru: <strong>Brain Import Price</strong> - Импорт товаров из прайса в формате CSV.

source: Brain Import Price
ru_ru: Импорт прайса Брейн

source: It seems the character encoding provided under General Settings on the Settings tab - <code>%s</code> - didn't match this import file so we automatically detected the character encoding for you to <code>%s</code>.
ru_ru: Кажется, кодировке, выбранной в Общих Настройках на вкладке Параметры - <code>% s </code> - не соответствует этот файл импорта, поэтому мы автоматически обнаружили кодировку для вас <code>% s </code> ,

source: It seems the field delimiter provided under Import Options - <code>%s</code> - didn't match this CSV so we automatically detected the CSV delimiter for you to <code>%s</code>.
ru_ru: Кажется, разделитель полей, указанный в Настройках импорта - <code>%s</code> - не соответствует этому CSV файлу, поэтому мы автоматически определили разделитель <code>%s</code>.

source: It seems either this CSV has only a single column or we were unable to automatically detect the CSV delimiter.
ru_ru: Или это файл CSV имеет только один столбец, или невозможно автоматически определить разделитель CSV.

source: Need help?
ru_ru: Необходима помощь?

# taxonomy general name
source: Brands
ru_ru: Производители

# taxonomy singular name
source: Brand
ru_ru: Производитель

source: Search Brands
ru_ru: Поиск по производителям

source: All Brands
ru_ru: Все бренды

source: Parent Brand
ru_ru: Основной брэнд

source: Parent Brand:
ru_ru: Основной брэнд

source: Edit Brand
ru_ru: Редактировать инфо о производителе

source: Update Brand
ru_ru: Обновить информацию о производителе

source: Add New Brand
ru_ru: Добавить нового производителя

source: New Brand Name
ru_ru: Новое название производителя

source: Brands
ru_ru: Производители

source: We couldn't load the export template file <code>%s</code> within <code>%s</code>, this file should be present.
ru_ru: Мы не можем загрузить файл шаблона єкспорта <code>%s</code> с <code>%s</code>, этот файл не существует.

source: You can see this error for one of a few common reasons
ru_ru: Вы можете увидеть эту ошибку для одной из нескольких распространенных причин

source: WordPress was unable to create this file when the Plugin was installed or updated
ru_ru: WordPress не удалось создать этот файл, когда плагин был установлен или обновлен

source: The Plugin files have been recently changed and there has been a file conflict
ru_ru: Файлы плагина были недавно изменены и было обнаружен конфликт файлов

source: The Plugin file has been locked and cannot be opened by WordPress
ru_ru: Плагин был заблокирован и не может быть открыт WordPress

source: Jump onto our website and download a fresh copy of this Plugin as it might be enough to fix this issue. If this persists get in touch with us.
ru_ru: Перейдите на наш сайт и скачайте свежую копию этого плагина, этого может быть достаточно, чтобы решить проблему. Если проблема остается - обратитесь к нам.

source: Optimize your WooCommerce Products for Search Engines
ru_ru: Оптимизирует Каталог товаров для поисковых машин

source: OK
ru_ru: Да

source: Install
ru_ru: Установить

source: Added %s to Past Imports
ru_ru: Добавлено %s для Прошлого импорта

source: %s already appears in Past Imports
ru_ru: %s уже появляется в Прошлом импорте

source: No Brands were provided
ru_ru: Не было указано производителей

source: We have just processed and generated so many Product Brands that we couldn't actually show you it in real-time, ~%d to be precise
ru_ru: Мы обработали и сгенерировали так много Производителей товаров, что не можем показать вам их в режиме реального времени, ~% d

source: Brands: %s
ru_ru: Производители: %s

source: Created Brands: %s
ru_ru: Создан Производитель: %s

source: Duplicate of Brands detected: %s
ru_ru: Обнаружен дублированный производитель: %s

source: Brands have been generated
ru_ru: Производитель был сгенерирован

source: No Categories were provided
ru_ru: Категории не были предоставлены

source: We have just processed and generated so many Product Categories that we couldn't actually show you it in real-time, ~%d to be precise
ru_ru: Мы обрабатываем и генерируем так много Категорий товаров, что мы не могли фактически показать вам его в режиме реального времени, ~% d, чтобы быть точным

source: Category: %s
ru_ru: Категория: %s

source: Created Category: %s
ru_ru: Создана категория: %s

source: Duplicate of Category detected: %s
ru_ru: Обнаружена дублированная категория: %s

source: Categories have been generated
ru_ru: Категории были сгенерированы

source: Your WordPress site does not allow changes to allocated memory limits, because of this memory-related errors are likely. %s
ru_ru: Ваш WordPress сайт не позволяет вносить изменения в выделенный лимит памяти, из-за этого, возникают ошибки, скорее всего, связанных с памятью. %s

source: Dismiss
ru_ru: Отсутствует

source: We recommend setting memory to at least %dMB prior to importing, your site has only %dMB allocated to it. See <a href="%s" target="_blank">Increasing memory allocated to PHP</a> for more information.<span style="float:right;"><a href="%s">Dismiss</a></span>
ru_ru: Мы рекомендуем установить память, по крайней мере %dMB до импорта, ваш сайт имеет только %dMB, выделенные на него. См. <a href="%s" target="_blank"> Увеличение памяти, выделенной для PHP </a> для получения дополнительной информации <span style="float:right;"><a href="%s"> Отменить </a></span>

source: Your WordPress site appears to be running PHP in 'Safe Mode', because of this the script timeout cannot be adjusted. This will limit the importing of large catalogues. %s
ru_ru: Ваш WordPress сайт работает в "безопасном режиме" PHP, из-за этого тайм-аута сценария не может быть изменен. Это ограничвает импорт больших каталогов. %s

source: The function mb_convert_encoding() requires the mb_strings extension to be enabled, multi-lingual import support has been disabled. %s
ru_ru: Функция mb_convert_encoding() требует, чтобы расширение mb_strings было включено, многоязычная поддержка импорта была отключена. %s

source: The function mb_list_encodings() requires the mb_strings extension to be enabled, if you are importing non-English and/or special characters the WordPress Transients we use during import will be corrupted and cause the import to fail.
ru_ru: Функция mb_list_encodings () требует, чтобы расширение mb_strings было включено. Если вы импортируете неанглийские и/или специальные символы в WordPress - мы используем их во время импорта - файл будет поврежден, и вызовет ошибку импорта.

source: Your WordPress site is running an older version of PHP which does not support the function str_getcsv(), a substitute will be used. %s
ru_ru: Ваш WordPress сайт работает на старой версии PHP, которая не поддерживает функцию str_getcsv (), будет использоваться замена. %s

source: Settings saved.
ru_ru: Настройки сохранены

source: Prices are recalculated.
ru_ru: Цены пересчитаны.

source: Your CSV file is empty, re-upload a populated CSV file from the opening import screen. <a href="%s" target="_blank">Need help?</a>
ru_ru: Ваш CSV файл пустой, повторно загрузите файл CSV. <a href="%s" target="_blank"> Нужна помощь? </a>

source: Your CSV file upload has expired, re-upload it from the opening import screen. <a href="%s" target="_blank">Need help?</a>
ru_ru: Ваш срок загрузки CSV файла истек, повторно загрузите его с экрана начала импорта. <a href="%s" target="_blank"> Нужна помощь? </a>

source: No CSV file was uploaded, check that a file is uploaded from the opening import screen. <a href="%s" target="_blank">Need help?</a>
ru_ru: CSV-файл не был загружен, убедитесь, что файл выбран на экрана начала импорта. <a href="%s" target="_blank"> Нужна помощь? </a>

source: Brain Import Price requires a CSV-formatted upload, if you are sure the file is a CSV please change the file extension and re-upload. <a href="%s" target="_blank">Need help?</a>
ru_ru: Импорту прайса Брейн требуется CSV-форматированный файл. Если вы уверены, что это файл CSV, пожалуйста, измените расширение файла и повторно загрузите <a href="%s" target="_blank"> Нужна помощь? </a>

source: No CSV file was uploaded. Please select a CSV to upload from the 'Choose File' dialog or other available upload options, alternatively select a CSV from Past Imports. <a href="%s" target="_blank">Need help?</a>
ru_ru: CSV-файл не был загружен. Пожалуйста, выберите CSV, чтобы загрузить в диалоговом окне "Выбрать файл" или других доступных вариантах загрузки. <a href="%s" target="_blank"> Нужна помощь? </a>

source: The file you're importing exceeded the maximum allowed filesize (see Maximum size), increase the file upload limit or import a smaller CSV file. <a href="%s" target="_blank">Need help?</a>
ru_ru: Файл, который вы импортируете превысил максимально допустимый размер файла (см Максимальный размер), увеличьте лимит загрузки файлов или импортируйте файл CSV меньшего размера. <a href="%s" target="_blank"> Нужна помощь? </a>

source: You cannot leave the Rate under Import Options empty.
ru_ru: Вы не можете оставить поле "Курс" пустым

source: You cannot leave the Margin under Import Options empty.
ru_ru: Вы не можете оставить поле "Наценка" пустым

source: You cannot leave the Field delimiter or Product Category separator options under Import Options empty. <a href="%s" target="_blank">Need help?</a>
ru_ru: Вы не можете оставить разделителей поля или категорий пустыми. <a href="%s" target="_blank">Нужна помощь?</a>

source: There was an error while uploading your CSV file, <em>%s</em>. %s
ru_ru: Произошла ошибка во время загрузки CSV файла, <em>%s</em>. %s

source: Your CSV file upload has expired, re-upload it from the opening import screen. %s
ru_ru: Срок загрузки CSV файла истек, загрузите его повторно с экрана начала импорта. %s

source: Resuming import...
ru_ru: Возобновляем импорт...

source: Generating Products...
ru_ru: Генерируем товары...

source: Your CSV contained special characters that WordPress and Brain Import Price could not filter. %s
ru_ru: Ваше CSV файл содержит специальные символы, которые WordPress и Импор прайса Брейн не может фильтровать. %s

source: Import method: %s
ru_ru: Метод импорта: %s

source: Validating required columns...
ru_ru: Проверяем требуемые колонки...

source: Product columns have been grouped
ru_ru: Колонки товара были сгруппированы

source: Update stock status...
ru_ru: Обновляем наличие на складе...

source: Generating Categories...
ru_ru: Генерируем категории...

source: Categories skipped
ru_ru: Категории пропущены

source: Generating Brands...
ru_ru: Генерируем производителей...

source: Brands skipped
ru_ru: Производители пропущены

source: Generating Tags...
ru_ru: Генерируем метки...

source: Tags skipped
ru_ru: Метки пропущены

source: Importing Products...
ru_ru: Импортируем товары...

source: Including non-essential reporting in this import log
ru_ru: В том числе несущественные отчетности в этом журнале импорта

source: Skipping import of first CSV row
ru_ru: Пропускаем импорт первой строки CSV

source: Starting import at first CSV row
ru_ru: Начинаем импорт первой строки CSV

source: Importing %s...
ru_ru: Импортируем %s...

source: Importing (no title) - SKU: %s...
ru_ru: Импортируется - Парт/Номер: %s...

source: Importing Product %d of %d...
ru_ru: Импортируется товар %d из %d...

source: Skipping Product, see Import Report for full explanation. Reason: %s
ru_ru: Пропускаем товар, смотрите отчет импорта для обьяснения.Основание: %s

source: Skipping Product, reason: %s
ru_ru: Пропускаем товар, основание: %s

source: %s successfully imported
ru_ru: %s успешно импортировано

source: (no title) - SKU: %s successfully imported
ru_ru: Парт/Номер: %s... успешно импортирован

source: Products have been generated
ru_ru: Товары были сгенерированы

source: Cleaning up...
ru_ru: Очищаем...

source: Searching for %s...
ru_ru: Производим поиск для %s...

source: Searching for (no title) - SKU: %s...
ru_ru: Поиск - Парт/Номер: %s...

source: Searching for Product %d of %d...
ru_ru: Ищем товар %d из %d...

source: Updating price
ru_ru: Обновляем цену

source: Organise Brands
ru_ru: Упорядочиваем производителей

source: Organise Categories
ru_ru: Упорядочиваем категории

source: Organise Tags
ru_ru: Упорядочиваем метки

source: Clean up has completed
ru_ru: Очистка была завершена

source: Import summary
ru_ru: Итоги импорта

source: %d Products added
ru_ru: %d товар добавлен

source: %d Products skipped
ru_ru: %d товар пропущен

source: Import took %s to complete
ru_ru: Импорт завершен - %s

source: Fastest Product took < %s to process
ru_ru: Самый быстрый товар < %s

source: Slowest Product took > %s to process
ru_ru: Самый медленный товар < %s

source: Import complete!
ru_ru: Импорт завершен!

source: Completed
ru_ru: Завершено

source: [product-importer] Could not save the import data Transient for the column %s
ru_ru: Не могу сохранить временные данные импорта для колонки %s

source: Good news! All of your Products have been successfully imported into WooCommerce.
ru_ru: Все ваши товары были успешно импортированы в базу данных

source: Here's the news. Some of your Products have been successfully imported into WooCommerce.
ru_ru: Некоторые из ваших товаров были успешно импортированы в базу данных

source: Here's the news. No new Products were imported into WooCommerce.
ru_ru: Нет новых товаров для импорта в базу данных

source: %s rows have been detected within this import file, and by the looks of it the first row contains the column headers. Let's get started!
ru_ru: %s строк было обнаружено в импортируемом файле, и первая строка выглядит как заголовки колонок. Итак, начнем!

source: %s rows have been detected within this import file. Let's get started!
ru_ru: %s строк были обнаружены в файле для импорта. Начнем!

source: Sufficient memory is available... %s
ru_ru: Доступно памяти... %s

source: Could not read file. Could not open the import file or URL.
ru_ru: Не могу прочитать файл. Не могу открыть файл импорта или URL

source: Could not read file. An empty import file was detected.
ru_ru: Не могу прочитать файл. J,yfhe;ty gecnjq afqk bvgjhnf

source: Could not read file. Brain Import Price doesn't have a record of this import file.
ru_ru: Не могу прочитать файл

source: The uploaded file exceeds the upload_max_filesize directive in php.ini
ru_ru: Загруженный файл превышает директиву UPLOAD_MAX_FILESIZE, которая была задана в файле php.ini

source: The uploaded file exceeds the MAX_FILE_SIZE directive that was specified in the HTML form
ru_ru: Загруженный файл превышает директиву MAX_FILE_SIZE, которая была задана в форме HTML

source: The uploaded file was only partially uploaded
ru_ru: Загружаемый файл был только частично прочитан

source: No file was uploaded
ru_ru: Файл не был загружен

source: Missing a temporary folder
ru_ru: Отсутствует временный Каталог

source: Failed to write file to disk
ru_ru: Не могу записать файл на диск

source: A PHP extension stopped the file upload
ru_ru: Раширение PHP остановило загрузку файла

source: Unknown upload error
ru_ru: Неизвестная ошибка загрузки

source: import file column validation failed
ru_ru: Проверка колонки импорта прервана

source: Import cancelled
ru_ru: Импорт прерван

source: sufficient data was provided
ru_ru: Было предоставлено достаточно данных

source: Beginning import...
ru_ru: Начинаем импорт...

source: PID debugging mode is enabled, no record changes will be made till WOO_BIP_DEBUG is de-activated from product-importer.php on line #22
ru_ru: Режим отладки PID включен, но записи изменений не будет пока WOO_BIP_DEBUG деактивировано в product-importer.php на строке #22

source: Detect and group Product columns...
ru_ru: Обнаруживаем и группируем колонки товара

source: SKU has been detected and grouped
ru_ru: Партномер был обнаружен и сгруппирован

source: Product Name has been detected and grouped
ru_ru: Название товара было обнаружено и сгруппировано

source: The SKU or Product Name column depending on the import method chosen must be selected to process an import.
ru_ru: Колонки Партномера или Названия товара в зависиомсти от выбранного метода импорта должны быть выбраны чтобы осуществить импорт

source: Description has been detected and grouped
ru_ru: Описание было обнаружено и сгруппировано

source: Price has been detected and grouped
ru_ru: Цена была переведена и сгруппирована

source: Brands has been detected and grouped
ru_ru: Производители был обнаружены и сгруппированы

source: Supplier Code has been detected and grouped
ru_ru: Код поставщика был обнаружен и сгруппирован

source: Warranty has been detected and grouped
ru_ru: Гарантия была обнаружена и сгруппирована

source: Category has been detected and grouped
ru_ru: Категория была обнаружена и сгруппирована

source: Tag has been detected and grouped
ru_ru: Метка была обнаружена и сгруппирована

source: Product URL has been detected and grouped
ru_ru: URL товара была обнаружена и сгруппирована

source: All in One SEO Pack - Keywords has been detected
ru_ru: All in One SEO Pack - Ключевые слова были обнаружены

source: All in One SEO Pack - Description has been detected
ru_ru: All in One SEO Pack - Описание было обнаружено

source: All in One SEO Pack - Title has been detected
ru_ru: All in One SEO Pack - Заголовок был обнаружен

source: All in One SEO Pack - Title Attributes has been detected
ru_ru: All in One SEO Pack - Аттрибуты заголовка были обнаружены

source: All in One SEO Pack - Menu Label has been detected
ru_ru: All in One SEO Pack - Метки меню были обнаружены

source: You must provide a minimum of Product Title to create new Products, hit Return to options screen to assign this column
ru_ru: Вы должны, как минимум, определить Название товара, чтобы создать новый товар, вернитесь к экрану настроек и укажите колонку

source: No specific reason was given for why the provided columns from this import file could not be validated, please raise this as a Premium Support issue with our team :)
ru_ru: Никаких конкретных причин не было дано, почему предоставленные колонки из этого файла импорта не могут быть подтверждены, пожалуйста, поднимите это как вопрос поддержки с нашей командой :)

source: Import validation failed
ru_ru: Ошибка проверки импорта

source: Import validation issue: %s
ru_ru: Проблема проверки импорта: %s

source: Temporary CSV deleted
ru_ru: Временный файл CSV удален

source: 1 second
ru_ru: 1 секунда

source: year
ru_ru: год

source: month
ru_ru: месяц

source: week
ru_ru: неделя

source: day
ru_ru: день

source: hour
ru_ru: час

source: minute
ru_ru: минута

source: second
ru_ru: секунда

source: SKU
ru_ru: Партномер

source: Product Name
ru_ru: Название товара

source: Description
ru_ru: Описание

source: Supplier Price
ru_ru: Цена поставщика

source: Category
ru_ru: Категория

source: Product URL
ru_ru: Ссылка на товар

source: Supplier Code
ru_ru: Код поставщика

source: Warranty
ru_ru: Гарантия

source: All in One SEO - Keywords
ru_ru: All in One SEO - Ключевые слова

source: All in One SEO - Description
ru_ru: All in One SEO - Описание

source: All in One SEO - Title
ru_ru: All in One SEO - Заголовок

source: All in One SEO - Title Attributes
ru_ru: All in One SEO - Аттрибуты заголовка

source: All in One SEO - Menu Label
ru_ru: All in One SEO - Метка меню

source: Getting Image file:
ru_ru: Получаем файл изображения:

source: A duplicate SKU already exists.
ru_ru: Дублированный Партномер уже существует

source: No specific reason was given, raise this as a Support issue.
ru_ru: Никаких конкретных причин не было дано, задать этот вопрос разработчику

source: Could not save the Product, $post_data: %s | $product: %s
ru_ru: Не возможно сохранить товар, $post_data: %s | $product: %s

source: Setting Supplier Price: %s
ru_ru: Устанавливаем цену поставщика: %s

source: Setting Supplier Price
ru_ru: Устанавливаем цену поставщика

source: Skipping Supplier Price
ru_ru: Пропущена цена поставщика

source: Setting SKU: %s
ru_ru: Устанавливаем партномер: %s

source: Setting SKU
ru_ru: Устанавливаем партномер

source: Skipping SKU
ru_ru: Пропущен партномер

source: Setting Price: %s
ru_ru: Устанавливаем цену: %s

source: Setting Price
ru_ru: Устанавливаем цену

source: Skipping Price
ru_ru: Пропущена цена

source: Setting Supplier Code: %s
ru_ru: Устанавливаем код поставщика: %s

source: Setting Supplier Code
ru_ru: Устанавливаем код поставщика

source: Skipping Supplier Code
ru_ru: Пропущен код поставщика

source: Setting Warranty: %s
ru_ru: Устанавливаем гарантию: %s

source: Setting Warranty
ru_ru: Устанавливаем гарантию

source: Skipping Warranty
ru_ru: Пропущена гарантия

source: Setting Images and Long Description from: %s
ru_ru: Устанавливаем Изображение и Длинное описание из : %s

source: Setting Images and Long Description
ru_ru: Устанавливаем Изображение и Длинное описание

source: Skipping Images and Long Description
ru_ru: Пропускаем Изображение и Длинное описание

source: Linking Brands: %s
ru_ru: Связываем производителя: %s

source: Linking Brands
ru_ru: Связываем производителя

source: Linking Category: %s
ru_ru: Связываем категорию: %s

source: Linking Categories: %s
ru_ru: Связываем категории: %s

source: Linking Category
ru_ru: Связываем категорию

source: Linking Categories
ru_ru: Связываем категории

source: Skipping Category
ru_ru: Пропущена категория

source: Linking Tag: %s
ru_ru: Связываем метку: %s

source: Linking Tags: %s
ru_ru: Связываем метки: %s

source: Linking Tag
ru_ru: Связываем метку

source: Linking Tags
ru_ru: Связываем метки

source: Skipping Tag
ru_ru: Метка пропущена

source: No Product Tags were provided
ru_ru: Не были предоставлены метки товара

source: We have just processed and generated so many Product Tags that we couldn't actually show you it in real-time, ~%d to be precise
ru_ru: Мы обработали и сгенерировали так много меток товара, что не можем показать вам их в режиме реального времени, ~% d

source: Product Tag: %s
ru_ru: Метка товара: %s

source: Created Product Tag
ru_ru: Создаем метку товара

source: Error creating Product Tag - Error - %s
ru_ru: Ошибка создания метки товара - Ошибка - %s

source: Error creating Product Tag
ru_ru: Ошибка создания метки товара

source: Duplicate of Product Tag detected
ru_ru: Обнаружена дублированная метка товара

source: Product Tags have been generated
ru_ru: Метка товара была сгенерирована

source: You can manage your Products now by visiting the Products section, otherwise jump back to the opening import screen to import additional Products.
ru_ru: Вы можете настроить каталог товаров, посетив раздел Товары в Административной панели, в противном случае перейдите к экрану импорта чтобы импортировать дополнительные товары.

source: Manage Products
ru_ru: Управление товарами

source: Import Products
ru_ru: Импорт товаров

source: You can manage your Products now by visiting the Products section, to understand why some of your Products were skipped please see below.
ru_ru: Вы можете управлять каталогом товаров, посетив раздел Товары, чтобы понять, почему некоторые из ваших товаров были пропущены - смотрите ниже.

source: Skipped Products (%d)
ru_ru: Пропущен товар (%d)

source: Ensure the skipped Products listed below are filled correctly then jump back to the opening import screen to re-import these Products.
ru_ru: Посмотрите пропущенные товары, перечисленные ниже, заполните правильно, перейдите обратно на экран начала импорта и повторно импортируйте эти товары.

source: Price
ru_ru: Цена

source: Reason
ru_ru: Причина

source: Import took %s to complete.
ru_ru: Импорт %s завершен.
