Repository: Barmaley74/Brain-Import-Price
Catalog: woo_bip-*.po
Languages: ru_ru

source: The import process has completed, click the Finish Import button to review the import outcome.
ru_ru: Процесс импорта был завершен, нажмите кнопку "Завершить импорт" чтобы посмотреть сообщения

source: Preparing data...
ru_ru: Подготавливаю данные...

source: Show installation messages
ru_ru: Показать сообщения установки

source: Return to options screen
ru_ru: Возврат к экрану опций

source: Finish Import
ru_ru: Завершить импорт

source: Reload to resume
ru_ru: Загрузить снова чтобы возобновить

source: Hit your browser's Refresh (F5) button to reload this screen.
ru_ru: Нажмите кнопку F5 чтобы перезагрузить экран браузера

source: Pause import
ru_ru: Остановить импорт

source: Using the drop down menu match each column in your import file to a Product detail, then click Upload file and import.
ru_ru: Используйте выпадающее меню, чтобы связать каждую колонку в вашем файле с деталями товаров, затем нажмите кнопку "Загрузить файл и импортировать"

source: Value
ru_ru: Значение

source: <small>(*)</small> If your CSV contains special characters - such as &aelig;, &szlig;, &eacute;, etc. - they may display weird under the First and Second Row above, please continue regardless.
ru_ru: <small>(*)</small> Если ваш CSV файл содержит специальные символы, например &aelig;, &szlig;, &eacute;, и т.п. - они могут отображаться неправильно в первой и второй стоке, пожалуйста, продолжайте.

source: Import Options
ru_ru: Опции импорта

source: First row skip
ru_ru: Пропуск первой строки

source: Skip the first row of the import file if it contains column headers. Brain Import Price detects columns headers at upload time and toggles this option if neccesary.
ru_ru: Пропустить первую строку файла импорта, если он содержит заголовки столбцов. Импорт прайса Брейн обнаруживает колонны заголовки во время загрузки и переключает эту опцию если понадобится.

source: Advanced import reporting
ru_ru: Расширенный отчет импорта

source: This option will provide a more detailed import log but comes at the expense of a slower import process. Default is off.
ru_ru: Эта опция обеспечивает более подробный журнал импорта, но идет в ущерб скорости процесса импорта. По умолчанию выключено.

source: Only price update
ru_ru: Обновлять только цены

source: Updates only supplier price for existing products.
ru_ru: Обновляет только цены поставщика для существующих товаров

source: Parsing data from internet
ru_ru: Загружать данные из интернета

source: Update data from supplier site for existing products.
ru_ru: Обновлять данные с сайта поставщика для существующих товаров

source: Insert Brands how taxonomies
ru_ru: Вставить Производителя как таксономию

source: Add taxonomy field for Product brand.
ru_ru: Добавить поле таксономии для Производителя товара

source: Insert Brands how attributes
ru_ru: Вставить Производителя как атрибут

source: Add attribute field for Product brand.
ru_ru: Добавить поле атрибута для Производителя товара

source: Script timeout
ru_ru: Тайм-аут скрипта

source: %d minutes
ru_ru: %d минут

source: %d hour
ru_ru: %d часов

source: Unlimited
ru_ru: Неограничено

source: Script timeout defines how long Brain Import Price is 'allowed' to process your CSV file, once the time limit is reached the import process halts. Default is 10 minutes.
ru_ru: Тайм-аут сценария определяет, как долго плагину "разрешается времени", чтобы обработать ваш файл CSV, когда лимит времени будет достигнут - процесс импорта останавливается. По умолчанию составляет 10 минут.

source: Upload file and import
ru_ru: Загрузить файл и импортировать

source: <strong>Note</strong>: If the following screen goes blank simply hit your browser's Refresh (F5) button to continue the import process. If this fails please consult the <a href="%s" target="_blank">Usage page</a> of this Plugin for further assistance.
ru_ru: <strong>Примечание</strong>: Если следующий экран гаснет - нажмите кнопку вашего браузера Обновить (F5), чтобы продолжить процесс импорта. Если это не удается, пожалуйста, обратитесь к <a href="%s" target="_blank"> Использование </a> этого плагина для получения дополнительной помощи.

source: Price Creating
ru_ru: Формирование цен

source: Upload Products
ru_ru: Загрузить товары

source: Import Modules
ru_ru: Модули импорта

source: Hello! Upload your Product spreadsheet - formatted as a CSV file - and we'll import your Products into WooCommerce.
ru_ru: Привет! Загрузите ваш прайс - в формате файла CSV - и он будет импортирован в базу данных

source: Rate
ru_ru: Курс

source: Enter currency rate for calculating price
ru_ru: Ввведите курс для формирования цены

source: Trade Margin
ru_ru: Наценка, в %

source: The margin on which allegedly increased the price of the supplier
ru_ru: Наценка, на которую будет увеличена цена продажи от цены поставщика

source: Choose a file from your computer, then click Upload file to import.
ru_ru: Выберите файл на вашем компьютере и нажмите Загрузить для импорта

source: Choose a file from your computer
ru_ru: Выбрать файл на вашем компьютере

source: Choose your Product Catalogue/CSV (.csv) to upload, maximum size: %sMB.
ru_ru: Выбрать прайс в формате CSV для загрузки, максимальный размер: %s Мб

source: Reset
ru_ru: Сбросить

source: Field delimiter
ru_ru: Разделитель поля

source: The field delimiter is the character separating each cell in your CSV. This is typically the ',' (comma) character.
ru_ru: Разделитель поля - это символ, отделающий каждую ячейку в файле CSV. Обычно это символ запятой ','

source: Import and merge Product details from other WooCommerce and WordPress Plugins, simply install and activate one of the below Plugins to enable those additional import options.
ru_ru: Импорт и объединение деталей товаров от других WooCommerce и WordPress Плагинов, просто установите и активируйте один из ниже приведенных Плагинов для того, чтобы использовать эти дополнительные опции импорта.

source: Install via WordPress Plugin Directory
ru_ru: Установите через каталог плагинов WordPress

source: Visit the Plugin website
ru_ru: Посетить страницу плагина

source: No import modules are available at this time.
ru_ru: Нет доступных модулей импорта

source: Import
ru_ru: Импорт

source: Import Product into WooCommerce from a CSV-formatted file.
ru_ru: Импорт товаров в базу данных из прайса формата CSV

source: Upload a CSV file
ru_ru: Загрузить CSV файл

source: Import by file path
ru_ru: Импортировать с указанного пути

source: Import from file URL
ru_ru: Импортировать из URL

source: Import from remote FTP
ru_ru: Импорт с удаленного FTP

source: Settings
ru_ru: Настройки

source: Manage import options from a single detailed screen.
ru_ru: Управление настройками импорта на отдельной странице

source: Discounts
ru_ru: Скидки

source: Enable Discounts
ru_ru: Разрешить скидки

source: It enables the calculation of discounts for randomly selected products
ru_ru: Включает режим расчета скидок для случайно выбранных товаров

source: Count discount Products
ru_ru: Количество товаров со скидками

source: Number of Products for which you need to get discounts
ru_ru: Количество товаров, по которым необходимо получить скидки

source: Discount Margin
ru_ru: Наценка для товаров со скидками

source: The margin on which allegedly increased the price of the supplier. Must be smaller than the trading margin
ru_ru: Наценка, на которую будет увеличена цена продажи от цены поставщика. Должно быть меньше значения торговой наценки

source: Calculate the price
ru_ru: Пересчитать цены

source: General Settings
ru_ru: Общие настройки

source: CSV Settings
ru_ru: Настройки CSV

source: Manage import options across Brain Import Price from this screen.
ru_ru: Управление настройками импорта из этого экрана

source: Enable archives
ru_ru: Разрешить архивы

source: Yes
ru_ru: Да

source: No
ru_ru: Нет

source: Save uploaded files to the WordPress Media for downloading/re-importing later. By default this option is turned on.
ru_ru: Сохранить загруженные файлы в WordPress Media для импорта позднее. По умолчанию эта опция включена

source: Character encoding
ru_ru: Кодировка символов

source: System default
ru_ru: Настройки по умолчанию

source: Character encoding options are unavailable in PHP 4, contact your hosting provider to update your site install to use PHP 5 or higher.
ru_ru: Опции кодировки символов недоступны в PHP 4, обратитесь к хостинг-провайдеру, чтобы обновить ваш сайт, используйте PHP 5 или выше.

source: %s minutes
ru_ru: %s минут

source: %s hour
ru_ru: %s часов

source: Script timeout defines how long Brain Import Price is 'allowed' to process your CSV file, once the time limit is reached the import process halts.
ru_ru: Тайм-аут сценария определяет, как долго разрешается работать процессу импорта, чтобы обработать ваш файл CSV, когда лимит времени будет достигнут процесс импорта останавливается.

source: Save Changes
ru_ru: Сохранить изменения

source: Overview
ru_ru: Обзор

source: Prices
ru_ru: Цены
